#+TITLE: nur.codearsonist.com
#+SUBTITLE: NixOS, nix-darwin User Repository
#+AUTHOR: Piotr @peel Limanowski
#+DESCRIPTION: @peel's Nix User Repository for NixOS and nix-darwin
#+LICENSE: Creative Commons 0
#+OPTIONS: toc:nil
#+KEYWORDS: code arsonist, codearsonist, limanowski, piotr limanowski, scala, elixir, erlang, haskell
#+HTML_HEAD_EXTRA: <link rel="shortcut icon" href="https://codearsonist.com/favicon.ico" />
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="https://codearsonist.com/assets/css/screen.css" />
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="style.css" />
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Roboto+Slab:700,300,400|Source+Code+Pro:500" />

* Status
[[https://travis-ci.org/peel/nur-packages][https://travis-ci.org/peel/nur-packages.svg]]
[[https://peel.cachix.org][https://img.shields.io/badge/cachix-peel-blue.svg]]
#+NAME: expressions
#+BEGIN_SRC elisp :var path="../" ext="nix":type :exports none
(defun match (base-path path ext)
(let ((regex (concat "^\\(.*\\)" base-path "\\(.+.nix\\)$")))
     (if (string-match regex path)
       (match-string 2 path))))

(defun expressions (path ext)
  (mapcar '(lambda (current-path) (match path current-path ext)) (directory-files-recursively path ext)))

(defun link (path expression)
  (concat "[[./" path expression "]]"))

(mapcar (lambda (expression) (link path expression)) (expressions path "nix"))
#+END_SRC

#+RESULTS: expressions
| [[file:./../bloop.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../battery-notifier.nix]] | [[file:./../udiskie.nix]] | [[file:./../autocutsel.nix]] | [[file:./../dunst.nix]] | [[file:./../weechat.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../remacs.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../wee-slack.nix]] | [[file:./../core.nix]] | [[file:./../default.nix]] | [[file:./../]] | [[file:./../plugin.nix]] | [[file:./../default.nix]] | [[file:./../default.nix]] | [[file:./../]] | [[file:./../default.nix]] | [[file:./../non-broken.nix]] | [[file:./../overlay.nix]] |

